#+TITLE: 读：Python 随机数生成——从 random 到 secrets
#+AUTHOR: lujun9972,Claude Code
#+TAGS: Python,random,secrets
#+DATE: [2026-05-31 Sun]
#+LANGUAGE: zh-CN
#+OPTIONS: H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil
#+DESCRIPTION: Python 提供了两个随机数模块——random 用于普通场景，secrets 用于密码学安全场景。本文从随机整数、随机浮点数、随机选择讲起，演示伪随机数的可复现机制，最后介绍 secrets 模块的用法和选择依据。

本文是对 [[https://www.pythonmorsels.com/random-numbers/][Python Morsels: Random Numbers]] 一文的解读和整理。

Python 标准库里跟随机数打交道的模块有两个， =random= 和 =secrets= 。 =random= 生成伪随机数，速度快，日常用够了。 =secrets= 生成密码学安全的随机数，不可预测，安全相关的场景用这个。

先看最常用的几个操作。

* 随机整数， =randint= 与 =randrange=

最常用的随机整数函数是 =randint= 。它接受起始值和结束值，返回两者之间的随机整数， *包含两端* ：

#+begin_src python :results output
from random import randint
print(randint(1, 6))
#+end_src

#+begin_example
3
#+end_example

=random= 模块还有个 =randrange= 函数，命名和用法都跟内置的 =range= 函数一致。 =range= 能怎么调， =randrange= 就能怎么调。

只传终止值（从 0 到终止值之间，不包含终止值）：

#+begin_src python :results output
from random import randrange
print(randrange(10))
#+end_src

#+RESULTS:
: 2

#+begin_example
2
#+end_example

传起始值和终止值：

#+begin_src python :results output
print(randrange(5, 10))
#+end_src

#+begin_example
8
#+end_example

传起始值、终止值和步长：

#+begin_src python :results output
print(randrange(0, 100, 10))
#+end_src

#+begin_example
90
#+end_example

=randint= 和 =randrange= 的区别在于对终止值的处理。 =randint(1, 6)= 可能返回 6， =randrange(6)= 永远不会返回 6。需要随机整数时， =randint= 更直观。

